# Reinforcement Settings Numbering Method Property

Source: https://www.revitapidocs.com/2026/41b7c755-b580-71a4-fa3c-76ed4f4a326a.htm

---

| Reinforcement Settings Numbering Method Property |
| --- |

Identifies the type of the numbering method.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ReinforcementNumberingMethod NumberingMethod { get; set; }
```

```
Public Property NumberingMethod As ReinforcementNumberingMethod
	Get
	Set
```

```
public:
property ReinforcementNumberingMethod NumberingMethod {
	ReinforcementNumberingMethod get ();
	void set (ReinforcementNumberingMethod value);
}
```

```
member NumberingMethod : ReinforcementNumberingMethod with get, set
```

#### Property Value

ReinforcementNumberingMethod Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Remarks This property can be used to modify the way that rebar sets with varying length bars are numbered. See Also

#### Reference

ReinforcementSettings Class Autodesk.Revit.DB.Structure Namespace